{
  "modelTopology": {
    "class_name": "Model",
    "config": {
      "name": "model2",
      "layers": [
        {
          "name": "input2",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 14],
            "dtype": "float32",
            "sparse": false,
            "name": "input2"
          },
          "inbound_nodes": []
        },
        {
          "name": "dense_Dense3",
          "class_name": "Dense",
          "config": {
            "units": 14,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          },
          "inbound_nodes": [[["input2", 0, 0, {}]]]
        },
        {
          "name": "dense_Dense4",
          "class_name": "Dense",
          "config": {
            "units": 2,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true
          },
          "inbound_nodes": [[["dense_Dense3", 0, 0, {}]]]
        }
      ],
      "input_layers": [["input2", 0, 0]],
      "output_layers": [["dense_Dense4", 0, 0]]
    },
    "keras_version": "tfjs-layers 3.21.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v3.21.0",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": ["./emotion-model.weights.bin"],
      "weights": [
        {
          "name": "dense_Dense3/kernel",
          "shape": [14, 14],
          "dtype": "float32"
        },
        { "name": "dense_Dense3/bias", "shape": [14], "dtype": "float32" },
        { "name": "dense_Dense4/kernel", "shape": [14, 2], "dtype": "float32" },
        { "name": "dense_Dense4/bias", "shape": [2], "dtype": "float32" }
      ]
    }
  ]
}
